{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [],
    "journals": [
        {
            "id": 3311,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "Is this a bug for real? When you open the limbo menu your position/camera switches near objectives. You hear the sound of the objective cam.",
            "created_on": "2014-08-02T18:44:06Z",
            "details": []
        },
        {
            "id": 3312,
            "user": {
                "id": 90,
                "name": "Saukko"
            },
            "notes": "Yeah it's so, as far as I remember correct. It was quite a while I reported this but I remember limbomenu having some sound related issues though. I will try to reproduce this one after I'm able to do so.\r\n\r\n-*S",
            "created_on": "2014-08-03T02:31:46Z",
            "details": []
        },
        {
            "id": 3334,
            "user": {
                "id": 90,
                "name": "Saukko"
            },
            "notes": "Ok so I might have gathered two bugs into one ticket if I remember right. But there's definitely an issue with the sounds in limbomenu.\r\nSo this following bug might be a bit irrelevant to this specific issue but it's something I recognized just a moment ago. Here is how to reproduce it:\r\n\r\n1. Spectate somebody\r\n2. Open up your limbomenu\r\n3. Choose a limbo camera that is far away from the current player you're spectating, f.e. a command post\r\n\r\nLike this you can hear the command post from the limbo camera you are watching in limbomenu + you hear only some of the sounds of the player you are \"spectating\". The best example is footsteps.\r\n\r\n-*S",
            "created_on": "2014-08-06T01:42:32Z",
            "details": []
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 520,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 1,
        "name": "Bug"
    },
    "status": {
        "id": 1,
        "name": "New"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 90,
        "name": "Saukko"
    },
    "category": {
        "id": 21,
        "name": "Mod generic"
    },
    "fixed_version": {
        "id": 8,
        "name": "2.78"
    },
    "subject": "When opening limbomenu and closing it right after, it stops sounds temporarily",
    "description": "So there is this when you spectate somebody for example and an announcer says something like \"Dynamite planted.\" If you open limbomenu it still plays, but when you close it during it' still saying it, it will stop announcing it. Other example is that some other sounds temporarily stop as well. For example satchel charge explosion and so on. The second example might be hard to spot by fact that you hear everything what you see in the limbo camera. So basically you hear sounds out of 2 sources at the same time.\r\n\r\n-*S",
    "start_date": "2014-02-22",
    "done_ratio": 0,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2014-02-22T19:04:41Z",
    "updated_on": "2014-08-06T01:42:32Z"
}