{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [
        {
            "revision": "5c22608cbbc2bf7e0e48e1491f89b49011eab0f7",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "game: allow medics to max out health from cabinet",
            "committed_on": "2015-08-23T09:31:50Z"
        }
    ],
    "journals": [
        {
            "id": 5176,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2015-08-20T15:36:11Z",
            "details": [
                {
                    "property": "attr",
                    "name": "subject",
                    "old_value": "Make Solider with SMG more useful",
                    "new_value": "Rebalance the game to make soldiers with SMG more useful"
                }
            ]
        },
        {
            "id": 5177,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "I really like this idea! The only fear I have is an increasing amount of panzernoobs, but they are way less frequent and annoying as rambomedics.\r\nIf it is done with a cvar, then I would set it as default, but I honestly think we can be a little bolder here and there and just push it in. People will adapt quickly.\r\n\r\n\r\n//OFFTOPIC: I've seen a mod somewhere where the soldier carries around a MG that he can drop and then be repaired by a friendly engi. This is also a neat idea to empower the soldier. Obviously this is a major game changer though.",
            "created_on": "2015-08-20T16:15:47Z",
            "details": []
        },
        {
            "id": 5178,
            "user": {
                "id": 44,
                "name": "Jacker"
            },
            "notes": "keMoN wrote:\r\n> I really like this idea! The only fear I have is an increasing amount of panzernoobs, but they are way less frequent and annoying as rambomedics.\r\n> If it is done with a cvar, then I would set it as default, but I honestly think we can be a little bolder here and there and just push it in. People will adapt quickly.\r\n> \r\n> \r\n> //OFFTOPIC: I've seen a mod somewhere where the soldier carries around a MG that he can drop and then be repaired by a friendly engi. This is also a neat idea to empower the soldier. Obviously this is a major game changer though.\r\n\r\nThe plan was not to add health to all soldiers, only if the Soldier has Thompson/MP40 as the main weapon will he get the health boost. The heavy weapon soldiers already server their purpose and as such don't need a boost, but the normal soldier class with a normal gun could use tweaking to make it a viable option to play with.",
            "created_on": "2015-08-21T08:20:02Z",
            "details": []
        },
        {
            "id": 5179,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Jacker wrote:\r\n> The plan was not to add health to all soldiers, only if the Soldier has Thompson/MP40 as the main weapon will he get the health boost. The heavy weapon soldiers already server their purpose and as such don't need a boost, but the normal soldier class with a normal gun could use tweaking to make it a viable option to play with.\r\n\r\nI'll check how this is implemented in ETQW, but I'm not convinced restricting the health boost to the weapon carried is necessary, not mentioning this does add issues when the player change weapon on field. Adding the extra health boost to the entire soldier class won't make any difference anyway, or only a marginal difference.\r\n\r\nThe extra 16hp won't help a panzernoob to launch panzer any better, or a MG/flamer to move faster in a fight. This is truly about 1vs1 SMG fight where medic have actually always the upper hand, because they accumulate all the \"bonus\" available in the game (extra HP + health regeneration + medpack). \r\n\r\n",
            "created_on": "2015-08-21T08:59:13Z",
            "details": []
        },
        {
            "id": 5180,
            "user": {
                "id": 35,
                "name": "Dragonji"
            },
            "notes": "Boost for soldiers is not necessary. At most give them more ammo for SMG. Really needed thing is to nerf medics. They have most HP, they can heal themselves, their HP automatically regenerates. They are incredibly OP.",
            "created_on": "2015-08-21T10:41:19Z",
            "details": []
        },
        {
            "id": 5181,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "Spyhawk wrote:\r\n> I'll check how this is implemented in ETQW, but I'm not convinced restricting the health boost to the weapon carried is necessary, not mentioning this does add issues when the player change weapon on field. Adding the extra health boost to the entire soldier class won't make any difference anyway, or only a marginal difference.\r\n> \r\n> The extra 16hp won't help a panzernoob to launch panzer any better, or a MG/flamer to move faster in a fight. This is truly about 1vs1 SMG fight where medic have actually always the upper hand, because they accumulate all the \"bonus\" available in the game (extra HP + health regeneration + medpack).\r\n\r\nI'm completely on your side here. When carrying heavy weapons a soldier is already increadibly slow, so I think the extra health is actually a pretty fair thing. Also the soldier can have a Thompson/MP40 as secondary weapon, so what makes him different from a soldier that chose to carry only Thompson/MP40?\r\n\r\n\r\nDragonji wrote:\r\n> Boost for soldiers is not necessary. At most give them more ammo for SMG. Really needed thing is to nerf medics.\r\nHowever I also agree with Dragonji. The most important thing is nerfing the medics! \r\n\r\nBut I still don't see how giving the soldier extra health could go completely wrong. I mean it just makes more sense actually to boost your heavy weapons support. In real life that is done with increased armor etc, simply because they are a slower target. Medics on the other hand quite often only had sidearms, because they were rather behind their team mates. (No real knowledge!)",
            "created_on": "2015-08-21T11:47:28Z",
            "details": []
        },
        {
            "id": 5182,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Let's be straight here:\r\n\r\nThe actual question I'd like to answer is not \"How do we rebalance the gameplay?\", because lots of mods tried that already, and to be honest they all failed in some way because balancing a game is very difficult/time taking. This is road to hell if you don't take care of careful statistical analysis.\r\n\r\nThe question I'd like to answer here is \"How does the medic/soldier rebalancing as done by Splash Damage in ETQW translates when applied to original ET?\". In other words, they recognized something had to be changed in the balance and they changed it, with extensive testing and experimentation. Why not building up upon this knowledge? Although yes, both game have a similar gameplay (on the GDF side at least), yet they are still different game.",
            "created_on": "2015-08-21T13:32:16Z",
            "details": []
        },
        {
            "id": 5183,
            "user": {
                "id": 44,
                "name": "Jacker"
            },
            "notes": "balancing is not something that is done once, most popular games nerf or boost different aspects of the game with every path. We can test things and fix issues as they arise.",
            "created_on": "2015-08-21T14:23:59Z",
            "details": []
        },
        {
            "id": 5184,
            "user": {
                "id": 479,
                "name": "yfcz"
            },
            "notes": "Spyhawk wrote:\r\n> The extra 16hp won't help a panzernoob to launch panzer any better, or a MG/flamer to move faster in a fight. This is truly about 1vs1 SMG fight where medic have actually always the upper hand, because they accumulate all the \"bonus\" available in the game (extra HP + health regeneration + medpack).\r\nExtra 16 HP could help to survive one more shot from SMG. It gives extra time to Soldier to launch panzer.\r\nSoldier with panzer is powerful enough, there is no need to buff it. Lets be conservative here.\r\n\r\nBased on my long-term experience as very addicted ETPro public player I see Panzerfauts, MG and mortar very capable.\r\nVery different story is with flamer and SMG. Flamer is very weak in most situations and you will do much better with other weapons/classes. In my opinion it makes sense to buff SMG/flamer soldier only. \r\n\r\nBuffing panzer/mg/mortar could hurt gameplay. Let's be conservative here pls.\r\n\r\nBut there is already one known case where could be SMG soldier pretty handy. It's when you restrict use all other classes to low numbers of use and leave numbers of soldier unrestricted. But in past 10 years nobody really used this feature.\r\n\r\nSpyhawk wrote:\r\n> Let's be straight here:\r\n> \r\n> The actual question I'd like to answer is not \"How do we rebalance the gameplay?\", because lots of mods tried that already, and to be honest they all failed in some way because balancing a game is very difficult/time taking. This is road to hell if you don't take care of careful statistical analysis.\r\nThe problem with other mods (exept etpro/etmain) is that they provided too powerful settings for unaware game admins. These setting can change gameplay radically. And they do!  The mod developers really don't have game balance or gameplay under their control anymore. Game admins do.\r\n\r\nJacker wrote:\r\n> balancing is not something that is done once, most popular games nerf or boost different aspects of the game with every path. We can test things and fix issues as they arise.\r\nBut developers of such games have under control their game servers and can remove outdated stuff from servers. You can't. Remember 2.55 vs 2.60b fight?",
            "created_on": "2015-08-21T15:17:28Z",
            "details": []
        },
        {
            "id": 5185,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "Whatever you add for rebalancing please add a CVAR and don't set it as default. ",
            "created_on": "2015-08-22T06:38:35Z",
            "details": []
        },
        {
            "id": 5186,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "IR4T4 wrote:\r\n> Whatever you add for rebalancing please add a CVAR and don't set it as default.\r\n\r\nI guess it is clear by now that a cvar is needed...\r\n\r\n{FIXME}\r\n* -allow the buffed class to increase health with medpack taken from cabinet. This works with medpack, and since medics have regeneration that issue has never been noticed.- done",
            "created_on": "2015-08-22T06:43:50Z",
            "details": []
        },
        {
            "id": 5187,
            "user": {
                "id": 44,
                "name": "Jacker"
            },
            "notes": "Spyhawk wrote:\r\n> IR4T4 wrote:\r\n> > Whatever you add for rebalancing please add a CVAR and don't set it as default.\r\n> \r\n> I guess it is clear by now that a cvar is needed.\r\n\r\nIn my opinion making everything cvar: able is a bad thing, trying to balance classes with cvar flags will result in every server having different settings, and no one will actually ever test the new setting.\r\n\r\nJust make it a C Macro.",
            "created_on": "2015-08-22T08:06:40Z",
            "details": []
        },
        {
            "id": 5252,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Had a closer look at ETQW, here how it is implemented for GDF team (just to give some rough idea):\r\n* Everyone starts with 100 HP (like ET)\r\n* +5HP bonus per medic in team (ET is 10HP, maxed to 25 HP)\r\n* (ET Battle Sense level 3 gives +15HP)\r\n* +20HP bonus for soldier (ET gives +12% more to medics)\r\n* autoregeneration for all class that have Battle sense level 4 (ET medics heal 3 HP/sec to MAXHEALTH, then 2 HP/sec to fill the 12% bonus)\r\n* medpacks give 25 HP, medic level 1 have better Medpack (30HP?) (ET medpacks give 20 HP)\r\n* medics can give 4 medpack before their power bar is depleted (same as ET)",
            "created_on": "2015-09-02T19:03:53Z",
            "details": []
        },
        {
            "id": 5270,
            "user": {
                "id": 9,
                "name": "Mateos"
            },
            "notes": "And the \"dynamite\" was given to the Soldier, so Engis just repair stuff, and the Soldier has a real role :P\r\n\r\nI'd limit the amount of med kits a medic can grab in a given amount of time, so they can't just run away healing themselves... Would just affect dropped kits, not the ones on cabs\r\n\r\nMost games give the Medics faster movements, but I don't think that's a good idea for ET\r\n\r\nAll in all, even though the Medic has more health, if you're a good shooter, you can down them. It's harder if they started to shoot, but heh, that's a challenge :P\r\n\r\nFlamer is fine imo: it does damage over the time, can reach large groups, can harden the sight and shooting of the target...\r\n\r\nA cvar is a good solution, for the people wanting to have at least the choice, may they like or not that new feature\r\n\r\nOh, and also: you're willing to nerf the Medic because of the players using him as an attacking class, while I'm sure he was supposed to get in the middle reviving people...\r\nWhat about a resistance boost when the syringe is equipped?",
            "created_on": "2015-09-11T11:58:38Z",
            "details": []
        },
        {
            "id": 5272,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "I also would avoid adding another cvar. Either implement it as default (which I would appreciate) or don't do it at all!\r\n\r\n>What about a resistance boost when the syringe is equipped?\r\nThen medics would equip the syringe to run away from a gunfight.",
            "created_on": "2015-09-11T18:13:55Z",
            "details": []
        },
        {
            "id": 5273,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Yep, syringe would somewhat acts as adrenaline. I do believe medic taking their own medpack is fine actually (healing others but not themselves is kinda weird to be honest..), but we can nerf other parameters. As I see it, the issue is that medics, in a 1 vs 1 fight, have *always* the edge.\r\n\r\nAs a first step, looking at the ETQW implementation, I'd try to\r\n* move the extra 12% bonus from medics to soldiers\r\n* disable auto-regeneration for medics\r\n\r\nI also did try to change the medic bonus team to a soldier bonus team instead, and the result is quite interesting: having too many medics in a team has a negative impact on the whole team (in current ET it always has a positive impact), so there is an additional tactic element here.",
            "created_on": "2015-09-11T18:39:03Z",
            "details": []
        },
        {
            "id": 5274,
            "user": {
                "id": 35,
                "name": "Dragonji"
            },
            "notes": "Spyhawk wrote:\r\n> * disable auto-regeneration for medics\r\n\r\nOr add regeneration for all classes and make it globally slower.",
            "created_on": "2015-09-11T18:42:25Z",
            "details": []
        },
        {
            "id": 5275,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Two more ideas discussed on IRC:\r\n\r\nDon't remove autoregeration, but:\r\n* use a \"cooldown\" feature so medic don't have regeneration in fights. This is already implemented in the code to calculate battlefield points (see COMBATSTATE).\r\n* lower regeneration rate, from 3HP/sec to 1HP/sec or even less. ",
            "created_on": "2015-09-11T19:33:35Z",
            "details": []
        },
        {
            "id": 5294,
            "user": {
                "id": 9,
                "name": "Mateos"
            },
            "notes": "keMoN wrote:\r\n> I also would avoid adding another cvar. Either implement it as default (which I would appreciate) or don't do it at all!\r\n> \r\n> >What about a resistance boost when the syringe is equipped?\r\n> Then medics would equip the syringe to run away from a gunfight.\r\n\r\nNo, they would rather heal themselves, because when they run away, their health is low enough to be killed :)\r\n\r\nSo you want to implement it as a default and non-deactivated feature? So people are forced to cope with it?\r\n\r\nEven though I think this feature is a good thing, and even a progress, I don't like \"forcing\" people. But that's my pov :D",
            "created_on": "2015-09-14T08:27:40Z",
            "details": []
        },
        {
            "id": 5296,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Mateos wrote:\r\n> So you want to implement it as a default and non-deactivated feature? So people are forced to cope with it?\r\n> \r\n> Even though I think this feature is a good thing, and even a progress, I don't like \"forcing\" people. But that's my pov :D\r\n\r\nThe general consensus is that medics are overpowered in the base game. If that is a feature, then we should remove it, and if that is a bug then we should fix it. Beside, check the changelog. We already \"force\" lot of small gameplay change. The only difference I see here is that rambo medic won't be pleased. They'll actually have to be better and play more as a team to succeed.\r\n\r\nIf we can find *minimal* changes that improve the gameplay balance, then I personally don't see any reason not to make it a default without a possible option (which would have its set of drawback). Whatever you do, you can't please everyone, so let's please ourselves first - players that also like Legacy will play it.",
            "created_on": "2015-09-14T10:47:48Z",
            "details": []
        },
        {
            "id": 5297,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2015-09-14T12:42:04Z",
            "details": [
                {
                    "property": "attr",
                    "name": "description",
                    "old_value": "Soldiers with SMG are usually never seen in game as they are utterly useless. They have minimal combat capacity and not strict advantage over any other class. They do have 2 SMG once the Soldier skill reached lvl 4, but this is a very small advantage when other people can have akimbo pistols.\r\n\r\nIdea: reinforce the Soldier role in game similarly to what Splash Damage did in ETQW:\r\n\r\n* Give the extra health bonus to soldier instead of giving it to medics (current: max health of medic is 156, other class is 140).\r\n* The more soldier in a team, the more health every players in a team has (current: the more medic, the more health for everybody)\r\n* Medics keep the health generation and ability to pick up their own medpack\r\n\r\nBy shifting the \"combat\" bonus from medic to regular soldiers, we might actually decrease the \"Rambo medic\" effect and introduce a whole new tactical aspect to the game.\r\n\r\nQuestions that arise:\r\n* Would this still be ET? Can this be part of the \"Legacy\" mod?\r\n* If yes, should this be introduced with an optional cvar? Should this cvar turned on by default?\r\n",
                    "new_value": "Soldiers with SMG are usually never seen in game as they are utterly useless. They have minimal combat capacity and not strict advantage over any other class.\r\n\r\nIdea: reinforce the Soldier role in game similarly to what Splash Damage did in ETQW:\r\n\r\n* Give the extra health bonus to soldier instead of giving it to medics (current: max health of medic is 156, other class is 140).\r\n* The more soldier in a team, the more health every players in a team has (current: the more medic, the more health for everybody)\r\n* Medics keep the health generation and ability to pick up their own medpack\r\n\r\nBy shifting the \"combat\" bonus from medic to regular soldiers, we might actually decrease the \"Rambo medic\" effect and introduce a whole new tactical aspect to the game.\r\n\r\nQuestions that arise:\r\n* Would this still be ET? Can this be part of the \"Legacy\" mod?\r\n* If yes, should this be introduced with an optional cvar? Should this cvar turned on by default?\r\n"
                }
            ]
        },
        {
            "id": 5301,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Implemented the following locally (currently with a macro):\r\n\r\n* moved the extra 12% bonus from medics to soldiers (soldiers still spawn with 100% health only, not 112%, similarly as it is currently done in vanilla for medics, but can increase it with additional medpack)\r\n* medic don't have regeneration for 5 seconds after receiving damages\r\n* regeneration rate lowered from 3HP/sec to 1HP/sec\r\n\r\nAlso tried with moving the team bonus from medics count to soldier count (as previously mentioned), but at the moment I'll keep it on the medic since this is not implemented anywhere else afaik (etqw).\r\n\r\nIt's not worth pushing into master until we've got a test server to collect feedback, to see what works better and what's worst:\r\n* Obviously, if rambo medics might be harder to play now, they might have a more difficult time to actually revive their teammate on the field.\r\n* Soldiers with a Thomson/MP40 will have the edge in a 1vs1 fight if, and only if, they have taken an additional medpack after spawn.",
            "created_on": "2015-09-15T17:43:57Z",
            "details": []
        },
        {
            "id": 5490,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "... just to mention: SMG is still optional and everybody knows it's not the best choice as soldier  ",
            "created_on": "2015-11-27T18:21:52Z",
            "details": []
        },
        {
            "id": 5673,
            "user": {
                "id": 110,
                "name": "Harlekin"
            },
            "notes": "Why don't let the soldier reload MG 42 within the Clip. I would love to reload on eg 30 bullets left and throw them away to get a new clip loaded.",
            "created_on": "2015-12-13T20:01:16Z",
            "details": []
        },
        {
            "id": 5675,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Harlekin wrote:\r\n> Why don't let the soldier reload MG 42 within the Clip. I would love to reload on eg 30 bullets left and throw them away to get a new clip loaded.\r\n\r\nAlready implemented, unless I don't understand what you mean here.",
            "created_on": "2015-12-13T20:15:52Z",
            "details": []
        },
        {
            "id": 5866,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Related discussion: https://dev.etlegacy.com/boards/3/topics/2558\r\n\r\nThe perfect solution for solving the rambo medic issue could be to remove the \"best fragger\" award. >:)",
            "created_on": "2016-04-03T20:59:21Z",
            "details": []
        },
        {
            "id": 6268,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2017-01-29T12:44:44Z",
            "details": [
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "8",
                    "new_value": "19"
                }
            ]
        },
        {
            "id": 6796,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "",
            "created_on": "2017-07-02T09:54:46Z",
            "details": [
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "19",
                    "new_value": "8"
                }
            ]
        },
        {
            "id": 7176,
            "user": {
                "id": 278,
                "name": "yks"
            },
            "notes": "But what about increasing the damage or accuracy of SMG when fired by soldier? Logic behind is that soldiers only purpose is that he can fight/shoot really well. That's his specialty.",
            "created_on": "2018-03-18T09:43:28Z",
            "details": []
        },
        {
            "id": 7179,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "This might be a possibility too.",
            "created_on": "2018-03-18T19:44:14Z",
            "details": []
        }
    ],
    "watchers": [
        {
            "id": 9,
            "name": "Mateos"
        }
    ],
    "time_entries": null,
    "id": 865,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 1,
        "name": "New"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 140,
        "name": "Spyhawk"
    },
    "category": {
        "id": 21,
        "name": "Mod generic"
    },
    "fixed_version": {
        "id": 8,
        "name": "2.78"
    },
    "subject": "Rebalance the game to make soldiers with SMG more useful",
    "description": "Soldiers with SMG are usually never seen in game as they are utterly useless. They have minimal combat capacity and not strict advantage over any other class.\r\n\r\nIdea: reinforce the Soldier role in game similarly to what Splash Damage did in ETQW:\r\n\r\n* Give the extra health bonus to soldier instead of giving it to medics (current: max health of medic is 156, other class is 140).\r\n* The more soldier in a team, the more health every players in a team has (current: the more medic, the more health for everybody)\r\n* Medics keep the health generation and ability to pick up their own medpack\r\n\r\nBy shifting the \"combat\" bonus from medic to regular soldiers, we might actually decrease the \"Rambo medic\" effect and introduce a whole new tactical aspect to the game.\r\n\r\nQuestions that arise:\r\n* Would this still be ET? Can this be part of the \"Legacy\" mod?\r\n* If yes, should this be introduced with an optional cvar? Should this cvar turned on by default?\r\n",
    "start_date": "2015-08-20",
    "done_ratio": 0,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2015-08-20T13:37:06Z",
    "updated_on": "2018-03-18T19:44:14Z"
}