{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [],
    "journals": [
        {
            "id": 6000,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "In my opinion it is definitely a feature and not a bug! :)\r\n\r\n*Please leave it in.* It would have a considerable effect on gameplay, which I think would be too much for a cvar flag, since behaviour on servers would be quite different.\r\n\r\n\r\n\r\nOn the technical side. You can repair or plant dynamite when- and whereever you are within a trigger, no matter what you are looking at. To implement that there would need to be a system where the player looks at a certain point (most likely the origin) of the constructible or would the whole structure (model) also work? Because depenind on the size of the structure a single point could be a problem.",
            "created_on": "2016-09-11T16:06:47Z",
            "details": []
        },
        {
            "id": 6005,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "You are right, a cvar just for this isn't worth it. The ability of engi to look around when building is also very important, and I'm now not sure this could be done easily either (due to the origin of the big structure, as you pointed out).\r\n\r\nA middle ground could be to only be able to start building when facing the obj (such as having the structure in a 180 degrees cone), while still allowing to look around when doing the building process itself. Is that worth it? I'm not so sure anymore.... I'm closing the ticket.",
            "created_on": "2016-09-12T08:39:52Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "6"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "100"
                }
            ]
        },
        {
            "id": 6006,
            "user": {
                "id": 44,
                "name": "Jacker"
            },
            "notes": "This could be done with simply calculating an angle from the center point of the buildable, and them limiting set angle to some value (90 degrees for example) but in a sense that has no value since an engineer is already well exposed when he/she is building. Making it even harder to build something would be rather silly on that aspect. But I would suggest taking a look at the way medics revive engineers on buildables making them immortal for the duration of the build. To me it was it was always strange that you could not kill an engineer that is fixing a tank/arming a dynamite just because the other team was smart about it and revived the engineer just at the right spot. Maybe remove the engineers ability to use pliers when they are in the 'just revived limbo mode' when they have spawn protection enabled.",
            "created_on": "2016-09-12T12:04:53Z",
            "details": []
        },
        {
            "id": 6007,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "I didn't know that was possible, Jacker and I agree with you. That should be changed. In my opinion removing the pliers while having spawn protection is the wrong way though. \r\nSpawn protection should simply be removed as soon as the player is taking action as in using any sort of weapon or any sort of special ability.\r\n\r\nIf an engi uses the pliers or is just setting dynamite or a landmine - remove spawnprotection.\r\nIs is possible for a Field Op to call in Airstrikes or Artillery? Or for a Medic to revive or give health packs? Because if so, then imo this should be changed as well.\r\nSpawn protection for me is only okay for the player to get to cover, not using it to push the objective in any way.\r\n\r\n//EDIT:\r\nThat last sentence is a bit foggy, since a player with spawn protection can still escort a vehicle to its end position and there is nothing the enemy can do.",
            "created_on": "2016-09-12T17:42:08Z",
            "details": []
        },
        {
            "id": 6008,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "We can drop the spawn protection for the engineer if plier is primary weapon?!\r\n\r\nI'm also missing an option to remove a player's spawn shield when an attack is started (before it wears off). Spawn protection at capturable spawns is real crap.\r\n\r\n",
            "created_on": "2016-09-12T19:56:20Z",
            "details": []
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 935,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 6,
        "name": "Invalid"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 140,
        "name": "Spyhawk"
    },
    "category": {
        "id": 21,
        "name": "Mod generic"
    },
    "fixed_version": {
        "id": 19,
        "name": "2.76"
    },
    "subject": "Engineers can built without facing the structure",
    "description": "Engineers can built structures that are in their back, they should only be able to bult when the object is under their pliers. Not sure if that would be considered a bug or if this could be a potential candidate for a g_misc option. ",
    "start_date": "2016-09-11",
    "done_ratio": 100,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2016-09-11T14:26:18Z",
    "updated_on": "2016-09-12T19:56:20Z",
    "closed_on": "2016-09-12T08:39:52Z"
}