{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [
        {
            "revision": "922894084b9c87650bf12d46bc9d56e3a93817f8",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "game: adjusted forced limbo value for better balance, fixes #1167",
            "committed_on": "2019-04-19T15:21:49Z"
        }
    ],
    "journals": [
        {
            "id": 7559,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "Yes, this is caused because we are currently using the real damage of players. We don't reset the damage to 0 when player is dead and the gib damage is reached earler depending on damage at kill time. It's more real (degree of wounding) but not predictible for competition players.\r\n\r\nThe question is: Should we do a cvar to switch both ways or make the pro style to the new standard beahviour?",
            "created_on": "2019-01-17T07:32:25Z",
            "details": [
                {
                    "property": "attr",
                    "name": "category_id",
                    "new_value": "17"
                }
            ]
        },
        {
            "id": 7563,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "-Yes, it's more a \"bugfix\" than intended gameplay change. Etpro simply uses vanilla behaviour afaik.- Edit: not true, see below. We didn't change any behaviour here, not did etpro.\r\n\r\nWe can always add a cvar and automatically switch between them in the competition and public config.",
            "created_on": "2019-01-17T11:44:50Z",
            "details": []
        },
        {
            "id": 7994,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "> On ETPro forcing into limbo always takes 113 damage (6 shots), regardless of damage received previously by dead player - for example if a player is backstabbed twice (receives much damage) it still takes 6 shots to force him into limbo.\r\n\r\nThis actually doesn't seem to be true. See hazz test on Etpro here: https://streamable.com/2lg83\r\n\r\n[18:30] hazz: that shot can be brought down to 1\r\n[18:30] hazz: if I get the player to 1hp before the 2nd stab :D\r\n[18:30] hazz: same with nade etc\r\n[18:30] Bystry: hmm then it might be the config\r\n[18:31] Bystry: i'm sure as hell that it took full 6 shots when i checked it\r\n[18:31] hazz: :o\r\n[18:31] Bystry: i wouldnt write it otherwise ^^\r\n[18:32] hazz: no idea what cvar it might be though :(\r\n\r\nWe'll need more information before being able to implement this feature.\r\n\r\nNote: random damage added to knive damage (0 to 4 points) exists in both Legacy and ETPro.",
            "created_on": "2019-04-19T09:57:32Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "4"
                }
            ]
        },
        {
            "id": 7995,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Ok, I think I got it. I wish etpro had a real and complete changelog, but we'll have to do without it.\r\n\r\n>  ETPro is forcing into limbo always takes 113 damage (6 shots), regardless of damage received previously by dead player\r\n\r\nThis isn't the case, as demonstrated above. The previously received damages are still taken into account. (nb: it's technically true only for damage dealt by SMGs - almost -, but not explosion or other weapons).\r\n\r\n> Wounded players now take 113 damage (6 shots) instead of 75 to force into limbo\r\n\r\nThis is all I could find in etpro website, and that wasn't even in any changelog entry... I haven't found any mention of a \"reset\" when the player dies.\r\n\r\nThis explain the double backstab issue:\r\n* By default  - and assuming etpro didn't change anything here -  a backstab will give 100 damages. For a normal player (one medic alone) with health bonus, medic has 123 health (100 + 12% medic bonus + 1*10). A quick double backstab put him quickly near the force limbo health limit (-77), and I assume the health generation is enough to keep him wounded, above the -75 limit. One SMG shot on Legacy (18 damage at close range) is enough to force into limbo. On etpro, 2 or 3 shots are enough to fill the gap (113 - 75 = 38, or just above 2 extra shots).\r\n* Assuming a second backstab at just above 0 health, the medic would be at just above -100 health (limbo on Legacy, not limbo on etpro) and a single shot would be enough on etpro to force into limbo.\r\n\r\nSuggestion: change FORCE_LIMBO_HEALTH from -75 to -113, and call it a day. I don't think any other change is required here (no cvar needed either - just make the change for everybody).",
            "created_on": "2019-04-19T13:07:59Z",
            "details": []
        },
        {
            "id": 7996,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Applied in changeset commit:922894084b9c87650bf12d46bc9d56e3a93817f8.",
            "created_on": "2019-04-19T15:26:18Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "4",
                    "new_value": "5"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "100"
                }
            ]
        }
    ],
    "watchers": [
        {
            "id": 421,
            "name": "kimi"
        }
    ],
    "time_entries": null,
    "id": 1167,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 5,
        "name": "Fixed"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 821,
        "name": "Bystry"
    },
    "category": {
        "id": 17,
        "name": "Mod QAGAME"
    },
    "fixed_version": {
        "id": 22,
        "name": "2.77"
    },
    "subject": "Make wounded players take 113 damage (6 shots) to force into limbo regardless of damage received previously",
    "description": "Currently forcing into limbo (gibbing) wounded players is too easy and fast as well as depends on damage received before death, making it very hard for medics to heal them and breaking the balance on some maps (prime example is  sp_delivery_te where it's very easy for axis to gib engineer and making it very hard for allies to build controls) in competitive play. This is one of the most important changes that should be done in legacy mod. These are the conclusions drawn by players from legacy competitive test matches and general discord discussion. \r\n\r\nOn ETPro forcing into limbo always takes 113 damage (6 shots), regardless of damage received previously by dead player - for example if a player is backstabbed twice (receives much damage) it still takes 6 shots to force him into limbo.\r\n",
    "start_date": "2019-01-17",
    "done_ratio": 100,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-01-17T02:14:53Z",
    "updated_on": "2019-04-19T15:26:18Z",
    "closed_on": "2019-04-19T15:26:18Z"
}