{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [
        {
            "revision": "7096c0f96175cbeba81881b579d9085782f0b7df",
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "comments": "cgame: add bp command, refs #233 #1198\n\nThis adds message area on the top of the screen.\n\nCan be used to print banners or other messages in a less\ndistractive way.\n\nThis does not implement the banner rotator,\nfor such feature check out the lua script:\nhttps://github.com/etlegacy/etlegacy-lua_scripts#banners\n\nClient cvars to control it:\ncg_drawBannerPrint - toggle the message area\ncg_bannerPrintTime - duration the message is displayed",
            "committed_on": "2020-02-23T18:40:24Z"
        },
        {
            "revision": "1b55e5946a20fbe37ef3a75e3cff79198f8bdbad",
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "comments": "cgame: refactor banner print cvars, refs #233 #1198\n\n* renamed cg_bannerPrintTime -> cg_bannerTime\n* deleted cg_drawBannerPrint (use cg_bannerTime)",
            "committed_on": "2020-02-24T09:01:20Z"
        },
        {
            "revision": "42df645e186f7075caf99296b760aee02f8732d3",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "ui: added banner time slider, refs #233 #1198",
            "committed_on": "2020-02-26T09:58:39Z"
        }
    ],
    "journals": [
        {
            "id": 7708,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "This concerns server administration, so this is better implemented in WolfAdmin.\r\n\r\nSee https://dev.timosmit.com/bugtracker/view.php?id=98. This is planned for the next release already.\r\nThere is also an existing Lua banner script \"here\":https://github.com/etlegacy/etlegacy-lua_scripts/tree/master/banners.\r\n\r\nClosing here.",
            "created_on": "2019-02-01T17:27:16Z",
            "details": [
                {
                    "property": "attr",
                    "name": "category_id",
                    "new_value": "21"
                },
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "6"
                },
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "new_value": "22"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "100"
                }
            ]
        },
        {
            "id": 7712,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "Hello, if I may, my two cents, this isn't just concerns the server side. This, usually, also requires client side modification in order to implement feature correctly. You see, pretty much every implementation, apart from the lazy one used in provided lua script, requires a dedicated message space, which is usually a top part of the screen, and a dedicated server command \"bp\" sent to the client to display the message on that spot. You should of course be able to select the place banner is printed using the aforementioned cvar, but usually it would default to \"bp\", and be displayed on the top of the screen. This way messages printed using \"bp\", instead of \"cp\", are less distracting and could be disabled all along using client cvar. Hereby, I suggest to reopen the issue and actually implement it in the mod.",
            "created_on": "2019-02-02T21:44:06Z",
            "details": []
        },
        {
            "id": 7719,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "A few things (personal pov and all):\r\n* banners shouldn't be able to be disabled by cvars client side. That's the point of a admin banner: being (more or less) useful mandatory spam from admins.\r\n* it's still server administration, and as such has not point in being implemented in the mod but better left to WA\r\n* implementing a new bp print mod side when admin can use cp reasonably is bloat, especially as it would only been used for such server administration feature. I'd rather not have that in the code.\r\n\r\nLastly, I'm personally not a fan of banners in general (or watermark as implemented in some mods). To me, it's unecessary admin spam/ads that is better left outside the game. cp/cpm does also the job more than reasonably for in-game info.",
            "created_on": "2019-02-03T13:16:38Z",
            "details": []
        },
        {
            "id": 7720,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "Personally not being fan of banners either, and this is why I am proposing to add bp, since otherwise you can't run away from cp/cpm based madness running by lua.\r\n\r\ncp, cpm and chat aren't good places for banners - it's annoying, distracting and useless. cpm prints are all about MODs and announcements, banners just won't be properly displayed simply due to the stream of MODs, more over banners are usually much longer, which could occupy more than a single line, leaving less space for something useful. As for cp banners, what can be worse? Having continuously repetitive messages printed on the center of the screen, definitely not for me. This is why I think banners should be controlled and have proper default behavior and place to be displayed, something you won't achieve with WA alone.",
            "created_on": "2019-02-03T14:43:36Z",
            "details": []
        },
        {
            "id": 7721,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "> banners - it’s annoying, distracting and useless.\r\n\r\nYeah, pretty much my view: banners are a _shitty_ feature, and certainly not a \"cool\" feature imho.\r\nIn fact, I'd be personally fine in not adding banners support at all (not even in WA, but that's outside of my control ^^), because well, why should we encourage admins to use them in the first place?\r\nEtpro might have it, but I really don't think we should add it because \"etpro did\".\r\nAnd again, adding some cvar to disable them client side doesn't make sense - better not adding the feature at all then. At least, using them as cp/cpm print force admins not using too much, or they become really annoying for players.\r\n\r\nHowever, I'm not strictly against adding a new print command - if (and only if) it does make sense somehow for the mod as a feature outside of abs/banners (but what?). Adding it just for the sake of displaying admin shit - no, I really don't want that. That's better left outside of Legacy mod.",
            "created_on": "2019-02-03T15:28:57Z",
            "details": []
        },
        {
            "id": 7722,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "Well whether we like it or not, banners gonna exist. I guess to address that issue, whoever thought about it first, decided to make it less distracting yet visible for any new player, and created bp to draw it on top. To be clear it's not just etpro feature, other mods also have it, to name few - etpub, jaymod, etrun and etjump (all can be checked in source code), and I have no doubts any other popular mod has it too. This just became some sort of standard among mods, and I guess people and scripts kinda expect bp to be there too. In etpro, bp is also used to draw match information in ettv mode (and maybe in shoutcaster mode), like times teams have set finishing specific goals in sw. Pretty sure I saw lua scripts are using bp to draw different kind of information too, like sprees. I mean it's not just for banners only really. To make it more generic I would suggest to give it different name, but I don't really want to break the standard naming convention over here. \r\nAnd I think not doing anything and allow polluting cp and cpm isn't a solution to the problem here, but we don't have to invent a solution really, since people already invented, it and this is bp!\r\n\r\nP.s. Sorry I can't have this discussion with you in discord, since I am away, and it's much easier to write here :p",
            "created_on": "2019-02-03T16:21:05Z",
            "details": []
        },
        {
            "id": 7723,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Well, if we do add banner print, I'd like to at least:\r\n* use it for some mod features (maybe geoIP stuff printed on connect when enabled?), rather than being empty just for the sake of being hooked by Lua only;\r\n* add a cvar to disable it client side. It's counter-intuitive to the very purpose of mandatory banners (see above), but serioulsy, admins can go eat d*icks. I don't want to see them in-game.\r\n* please anyone, don't ask about adding watermark ever.\r\n\r\nOther opinion welcome. Reopening in the meantime.",
            "created_on": "2019-02-03T16:31:14Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "6",
                    "new_value": "1"
                }
            ]
        },
        {
            "id": 7724,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "Sounds good to me.",
            "created_on": "2019-02-03T16:57:53Z",
            "details": []
        },
        {
            "id": 7731,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Kemon mentioned (jokingly?) that banners could be displayed to players when they are spectators only.\r\nThat might actually be a good solution, with minimal useless info displayed when people are playing, while still being visible at connection or other spec time.",
            "created_on": "2019-02-05T17:02:54Z",
            "details": []
        },
        {
            "id": 7733,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "I would just make bp command working, and let scripts to use it as needed. So we wouldn't concentrate as much on the banners as on some generic spot to print stuff? That implies that scripts would control when stuff is printed instead.",
            "created_on": "2019-02-06T09:08:29Z",
            "details": []
        },
        {
            "id": 7734,
            "user": {
                "id": 392,
                "name": "Timothy"
            },
            "notes": "Also, I'd like to quote this:\r\n\r\nkemon wrote (Discord 05/02/2019 18:21):\r\n> If there is currently banner spam in the chat then this is even worse than spam that is on the top of my screen, because I actually read the chat. So for me, moving the spam to the top would actually be better.\r\n\r\nI second this. Personally I'd prefer server info and related stuff to be printed at the top. Then we have a clear distinction for all areas:\r\n\r\nchat area: like the name implies, just chat messages (and command output from !commands)\r\ncpm: game info (e.g. objective updates, obituaries)\r\ncenter print: interactions that are relevant to the player\r\nbanner print: server information\r\nconsole: everything",
            "created_on": "2019-02-06T09:44:46Z",
            "details": []
        },
        {
            "id": 7737,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "I like the idea of banner prints to spectators only.",
            "created_on": "2019-02-06T19:05:44Z",
            "details": []
        },
        {
            "id": 7746,
            "user": {
                "id": 546,
                "name": "mrmuppet"
            },
            "notes": "IR4T4 wrote:\r\n> I like the idea of banner prints to spectators only.\r\n\r\nAgreed!",
            "created_on": "2019-02-09T00:52:43Z",
            "details": []
        },
        {
            "id": 7795,
            "user": {
                "id": 3,
                "name": "IR4T4"
            },
            "notes": "",
            "created_on": "2019-02-14T17:27:33Z",
            "details": [
                {
                    "property": "attr",
                    "name": "assigned_to_id",
                    "new_value": "505"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "100",
                    "new_value": "0"
                }
            ]
        }
    ],
    "watchers": [
        {
            "id": 392,
            "name": "Timothy"
        }
    ],
    "time_entries": null,
    "id": 1198,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 1,
        "name": "New"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 821,
        "name": "Bystry"
    },
    "assigned_to": {
        "id": 505,
        "name": "ryven"
    },
    "category": {
        "id": 21,
        "name": "Mod generic"
    },
    "fixed_version": {
        "id": 22,
        "name": "2.77"
    },
    "subject": "Add b_banners CVAR from etpro",
    "description": "Not much to say. Just a cool option for public legacy servers to put some additional info for players.",
    "start_date": "2019-02-01",
    "done_ratio": 0,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-02-01T17:14:34Z",
    "updated_on": "2019-02-14T17:27:33Z",
    "closed_on": "2019-02-01T17:27:16Z"
}