{
    "children": null,
    "attachments": null,
    "relations": [
        {
            "id": 409,
            "issue_id": 1230,
            "issue_to_id": 1171,
            "relation_type": "relates",
            "delay": null
        }
    ],
    "changesets": [],
    "journals": [
        {
            "id": 7932,
            "user": {
                "id": 40,
                "name": "hellreturn"
            },
            "notes": "Spyhawk wrote:\r\n> I didn't want to add such ticket till now, but that might prove to be the best course of action on the longer term.\r\n\r\nI had suggested same to Paul long time back as well in past but now i feel it's not correct solution long term.  More or less what happens when people go inactive or any of the maintainer account get hacked?\r\n\r\n1. Be careful with the idea because I have seen someone was able to fake our server IP and show up in master list.  Everything was same except port. I believe it's same concept as getstatus DDoS. All Windows ET 3.00 from Trackbase are effected.  Paul has no intention to fix it so far. \r\n\r\n2. I believe ETL master list does the same thing ? I.e. list servers using (ETL Binaries) on top before other ET binaries.  So with same logic, what those admins are doing is being done at another level by ETL team as well.  You can say because of some you have to do this and that but the fact is ETL is also doing same. \r\n\r\n3. Someone can also can run fake servers at cron job on dynamic intervals. Take SS with fake IP and blame it up on others. \r\n\r\n4. With SOCK5 proxies available in abundant, how many IP's will be banned? So far we have banned more then 350 subnets on our ALL servers, which consists of Class B, C and D subnets and I personally think, banning IP is not a solution. \r\n\r\nI was against mindless blocking and deleting of pk3 files without user consent and I am against mindless blocking. I hope you can find some elegant solution.  ",
            "created_on": "2019-04-02T15:07:47Z",
            "details": []
        },
        {
            "id": 7933,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "> 2. I believe ETL master list does the same thing ? I.e. list servers using (ETL Binaries) on top before other ET binaries. So with same logic, what those admins are doing is being done at another level by ETL team as well. You can say because of some you have to do this and that but the fact is ETL is also doing same.\r\n\r\nFor the record, this actually happens because of the humans player count we use. It is not inherently because of \"ETL\", and certainly not to give ETL binaries any advantage (we couldn't care more about that aspect tbh). Unlike 2.76, that feature is also now semi disabled in master branch and can only be fully enabled manually by the user. See #1171 for details.\r\n\r\nI otherwise agree with all of your points. The idea here was to manually blacklist after a thorough review of what could be considered admin abuse, but not automatically.\r\n\r\nFor full disclosure: I do find server facade completely moronic, misleading and disrepectuful towards players. They are part of what I'd _personally_ consider \"admin abuse\", but not necessarily in the context of that feature (if fact we do filter the most obvious of these already). You might or might not agree here.",
            "created_on": "2019-04-02T15:18:39Z",
            "details": []
        },
        {
            "id": 7934,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2019-04-02T15:22:42Z",
            "details": [
                {
                    "property": "relation",
                    "name": "relates",
                    "new_value": "1171"
                }
            ]
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 1230,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 1,
        "name": "New"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 140,
        "name": "Spyhawk"
    },
    "category": {
        "id": 1,
        "name": "Client"
    },
    "fixed_version": {
        "id": 8,
        "name": "2.78"
    },
    "subject": "Add dynamic server blacklist",
    "description": "I didn't want to add such ticket till now, but that might prove to be the best course of action on the longer term.\r\n\r\nAdd a dynamic server blacklist.\r\nWe would have a small IP list downloaded at client start, that would then be used to filter out facade and other shaddy servers. The list could be downloaded from github and updated by the community through Pull Request.\r\nThis would work kinda similarly to the planned whitelist for pk3 and mod bins.\r\n\r\nAdvantage is that we could list human players count for all servers (see #1171), without the risk of seeing it exploited by shameful admins.",
    "start_date": "2019-03-22",
    "done_ratio": 0,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-03-22T15:39:11Z",
    "updated_on": "2019-04-02T15:18:39Z"
}