{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [
        {
            "revision": "bf97e73ceb0f05a4c52f65586f1d9c256d7f0a29",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "ui: allow in-game fav button to add and remove server, refs #1281",
            "committed_on": "2019-05-09T13:36:27Z"
        },
        {
            "revision": "615d4e9a4d0cd2572e5c54ec4b7a5d5a439a7794",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "ui: reverted unintended change that breaks fav boxes, refs #1281",
            "committed_on": "2019-05-09T14:07:06Z"
        },
        {
            "revision": "b035ad7bc9f241c253c5dc8d758d18b45ac6798f",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "ui: possibly fixed the favorite button functionality, refs #1281",
            "committed_on": "2019-08-04T11:40:52Z"
        }
    ],
    "journals": [
        {
            "id": 8126,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "I'd reject this request. With the new containerized system (#1161), we need an easy way to add server to favorites. The button on serverinfo is way too much hidden (ie, useless).\r\nI assume PsycoPappy isn't aware of the upcoming changes - and might not like it (if they change the main menu too), but that's another issue.",
            "created_on": "2019-05-06T15:08:31Z",
            "details": []
        },
        {
            "id": 8127,
            "user": {
                "id": 256,
                "name": "keMoN"
            },
            "notes": "I understand both sides here.\r\nIf you want to add the server to your favourites you do that once and after that the button becomes obsolete. Also, does it display \"Remove from Favourites\" once it's favourited?^^\r\n\r\nI do understand the notion of not wanting a button that is likely used once per ET installation in the menu at all times, but I also understand the need for easy access to add said server.\r\nI guess we should leave it in for 2.77 at least and then maybe reconsider for 2.78 if people already organised their favourites maybe?\r\n\r\nFeel free to set to invalid if you don't see a problem.",
            "created_on": "2019-05-06T15:23:44Z",
            "details": [
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "22",
                    "new_value": "8"
                }
            ]
        },
        {
            "id": 8130,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "I think the real problem here is that PsycoPappy (which created the ETs menu) doesn't realize the \"Add to Favorites\" button is part of our efforts to prevent admins load any menu to users without their consent.\r\nIt's thus not \"unnecessary\", but it is indeed \"absolutely necessary\". It however quite long, maybe we can rename it as \"Add as favorite\" (1 less character)? Any better suggestion here?\r\n\r\nI really like the idea of displaying \"Remove Favorite\" once it's added, but I'm not sure is that is possible with the very inflexible UI system.",
            "created_on": "2019-05-06T15:48:24Z",
            "details": []
        },
        {
            "id": 8143,
            "user": {
                "id": 905,
                "name": "PsychoPappy4"
            },
            "notes": "ah, i see... you guys do have future plans with this button.\r\n\r\nI still think that having a button that's used once is redundant, and the text is indeed long and out-of-place making it the worst looking button in the menu.\r\n\r\ni also think not many people use the favorites system, i used to write down the IP addresses of my favorite servers, since the favorites system was not reliable, i got the IP address through the \"SERVER INFO\" menu.\r\n\r\nnow, you guys can add an \"ADD TO FAVORITES\" button outside the ingame_main menu in it's own window, since i proved it's possible with the ETS Menu that i developed.\r\n\r\nand also, if you guys are completely against admins loading menus you can incorporate a system that Silent 0.9.0 has, which blocks unofficial menu modifications while still allowing a custom menu to be loaded (ingame only). (also in silent 0.9.0, onOPEN events are ignored.)\r\n\r\nSide note: you guys can move the \"LIMBO MENU\" button down directly above the \"DISCONNECT\" button, like it is in NoQuarter since honestly it's the best place for this button, one of you guys can put that in it's own ticket.",
            "created_on": "2019-05-06T18:04:38Z",
            "details": []
        },
        {
            "id": 8144,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Again, you didn't get it: Favorites will be quite essential in the next release. Customized main menus will be more restricted because of admin abuse, and we already have a working system in place (with some minor details to look at). And its imho much better than silent's implementation.\r\n\r\nLimbo will stay on top. It's where it should be, because it's the most important button in the menu. We should probably move it to the very top, actually.",
            "created_on": "2019-05-06T18:12:39Z",
            "details": []
        },
        {
            "id": 8151,
            "user": {
                "id": 905,
                "name": "PsychoPappy4"
            },
            "notes": "Honestly though, with the \"LIMBO MENU\" button i don't see what's so hard with just tapping \"L\" on your keyboard to do the same thing?\r\n\r\nit's how i have done it since i started playing ET when i was 7 years old (2003), it's much easier and faster than pressing ESC and then clicking \"LIMBO MENU\".\r\n\r\nmoving the button to the very top is not exactly a good idea, let alone it's existence on the menu at all to begin with, (the L key considered.) :\\",
            "created_on": "2019-05-09T06:03:55Z",
            "details": []
        },
        {
            "id": 8152,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "We're not only maintaining the game for old players, and there are cases where having the button might be useful (unbind). Now, if you have other arguments than \"my customized menu will look bad\" (which seems to be your actual issue here), we'd be please to hear you. Otherwise, please stop taking valuable time.",
            "created_on": "2019-05-09T06:21:28Z",
            "details": []
        },
        {
            "id": 8154,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Button now works for adding and removing favorites. It's been shortened to \"Favorite\" only, with a popup detailing if the fav will be added or removed.",
            "created_on": "2019-05-09T13:41:05Z",
            "details": [
                {
                    "property": "attr",
                    "name": "tracker_id",
                    "old_value": "3",
                    "new_value": "2"
                },
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "5"
                },
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "8",
                    "new_value": "22"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "100"
                }
            ]
        },
        {
            "id": 8215,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Not always working as it should. After removing a server (from in-game), the button function isn't flipped and it won't propose to add the server, but to remove it again (only happens sometimes...?)",
            "created_on": "2019-05-19T14:27:41Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "5",
                    "new_value": "2"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "100",
                    "new_value": "90"
                }
            ]
        },
        {
            "id": 8425,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2019-08-04T11:42:02Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "2",
                    "new_value": "4"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "90",
                    "new_value": "100"
                }
            ]
        },
        {
            "id": 8434,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Not working yet. The button can be used to remove favorite, but not for adding them.",
            "created_on": "2019-08-15T21:27:15Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "4",
                    "new_value": "2"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "100",
                    "new_value": "80"
                }
            ]
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 1281,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 2,
        "name": "In Progress"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 256,
        "name": "keMoN"
    },
    "category": {
        "id": 15,
        "name": "Mod UI"
    },
    "fixed_version": {
        "id": 22,
        "name": "2.77"
    },
    "subject": "ingame_main.menu \"ADD TO FAVORITES\" button",
    "description": "Quote from the forums \"[original post]\":https://dev.etlegacy.com/boards/1/topics/3642\r\n\r\nHey there, i finally just managed to create an account here, with my username annoyingly without a space.\r\nBut now there is something i need to bring to light.\r\non the \"master\" branch of the ET Legacy Source code under /etmain/ui/ingame_main.menu\r\ni find the \"ADD TO FAVORITES\" Button to be unnecessary since it already exists under \"SERVER INFO\" (ingame_serverinfo.menu), especially the text looks messy and out-of-place compared to the rest of the menu.\r\n*My suggestion would be to remove this button from ingame_main.menu so the menu as a whole is cleaner and more uniform.*\r\n\r\nside note: the \"LIMBO MENU\" button should be put directly above the \"DISCONNECT\" button, it’s a much better spot for it. (matches noquarter too!)\r\n\r\nThe ingame_main.menu file that has my stated changes is attached below.\r\n\r\n- Ets|PsycoPappy 4",
    "start_date": "2019-05-06",
    "done_ratio": 80,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-05-06T13:16:03Z",
    "updated_on": "2019-08-15T21:27:15Z",
    "closed_on": "2019-05-09T13:41:05Z"
}