{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [
        {
            "revision": "90aadd58a40b9c356f8c872a0e9d5957aa2f97b3",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "cgame: sync fireteam health color with healthbar, refs #1291",
            "committed_on": "2019-05-18T16:45:36Z"
        },
        {
            "revision": "a6189bcbe852ae837a41a3c41833560dda84373e",
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "comments": "cgame: health color adjustment for better gradient, refs #1291",
            "committed_on": "2019-05-18T16:45:52Z"
        }
    ],
    "journals": [
        {
            "id": 8184,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2019-05-16T19:48:40Z",
            "details": [
                {
                    "property": "attr",
                    "name": "category_id",
                    "new_value": "16"
                },
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "new_value": "8"
                }
            ]
        },
        {
            "id": 8191,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "> When getting hit, I often realize it’s too late to heal because it takes a bit for the crosshair to actually change color when you get hit.\r\n\r\nIn short, the red colour appears at a too low value. Your proposed solution doesn't solve this issue for other classes, just for medic. Wouldn't changing the threshold to the same value for everyone be better?\r\nUsing a percentage doesn't make sense to me here, as you'd want to have the same indicator color for the same health level across the game.\r\n\r\n{TODO}\r\n* -ensure value are similar as in FT window.- (done, with the exception of using green when above 100).",
            "created_on": "2019-05-17T07:52:40Z",
            "details": []
        },
        {
            "id": 8196,
            "user": {
                "id": 286,
                "name": "Calinou"
            },
            "notes": "> Your proposed solution doesn’t solve this issue for other classes, just for medic. Wouldn’t changing the threshold to the same value for everyone be better?\r\n\r\nI believe this would also help solve the issue with other classes (though not as much as with the medic, as they have less health by definition). It might be just me, but one could see the medic as a \"more resistant\" class, which is why I think a percentage makes sense (there are some differences here and there, I know).\r\n\r\nAlso, if we use constant values, we might not be able to solve this issue fully, because one might start with a low maximum health if they play a non-medic class with no XP. For instance, if we set the \"white\" threshold to 125 HP, then players spawning with 100 HP would have a slightly yellow crosshair which could never turn white (until they gain enough XP).\r\n\r\nStill, I think using higher constant values for crosshair color thresholds would be an improvement over the current situation.",
            "created_on": "2019-05-17T12:21:16Z",
            "details": []
        },
        {
            "id": 8197,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "I guess my point above was to get specific color for specific health left. Max HP can greatly vary as you've seen, even in a single class due to the team medic bonus.\r\nThe indicator purpose is to let know the player when health level is critical - we don't really care about knowing if it is 120 or 140 HP, but we do when it's low.  Having such value that varies constantly across game/class sounds like a bad idea. It should be something players could rely on, rather than having to compute it in their head.\r\nWhat's needed is to have a warning at, let say for example, 3 SMG shots left before player is downed (so it would be 18*3 = 54 HP) - just an example, we could use 2 SMG shots left for red f.e.\r\n",
            "created_on": "2019-05-17T12:31:38Z",
            "details": []
        },
        {
            "id": 8211,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2019-05-18T17:00:23Z",
            "details": [
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "8",
                    "new_value": "22"
                }
            ]
        },
        {
            "id": 8276,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "",
            "created_on": "2019-06-07T19:33:31Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "4"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "50"
                }
            ]
        },
        {
            "id": 8297,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "The lower value is now set to 33 - or a third of the available base health. It's now synchronized with fireteam data. Unless there is more input given, I'd consider the implementation \"good enough\".",
            "created_on": "2019-06-13T09:04:25Z",
            "details": []
        },
        {
            "id": 8304,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Closing now. Please comment/reopen if additional work is required.",
            "created_on": "2019-06-16T13:15:06Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "4",
                    "new_value": "5"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "50",
                    "new_value": "100"
                }
            ]
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 1291,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 5,
        "name": "Fixed"
    },
    "priority": {
        "id": 3,
        "name": "Low"
    },
    "author": {
        "id": 286,
        "name": "Calinou"
    },
    "category": {
        "id": 16,
        "name": "Mod CGAME"
    },
    "fixed_version": {
        "id": 22,
        "name": "2.77"
    },
    "subject": "Scale crosshair health depending on maximum current health",
    "description": "Currently, the \"crosshair color by health\" feature will use constant values to color the crosshair (red = 25 HP, white = 100 HP). It would make more sense to make this value a percentage of the maximum health, so that it works better when playing classes with more HP. When getting hit, I often realize it's too late to heal because it takes a bit for the crosshair to actually change color when you get hit.\r\n\r\nFor example, if you're a medic with a maximum of 156 HP, the crosshair will be red until 39 HP (25% of the maximum health), then it will go through its usual red-yellow-white transition until the maximum value is reached (156 HP).",
    "start_date": "2019-05-16",
    "done_ratio": 100,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-05-16T18:10:53Z",
    "updated_on": "2019-06-16T13:15:06Z",
    "closed_on": "2019-06-16T13:15:06Z"
}