{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [],
    "journals": [
        {
            "id": 8350,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "This is indeed part of of the mod. Your suggestion sounds like a good improvement, but we however don't have access to map size information (apart the few that have it somehow in the name).\r\nI'd say this is more a server administration issue: admins should ensure map selection is adequate for their audience. I don't think we'd be able to find a good technical solution given the current limitation.",
            "created_on": "2019-07-05T06:29:43Z",
            "details": [
                {
                    "property": "attr",
                    "name": "category_id",
                    "old_value": "5",
                    "new_value": "21"
                },
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "new_value": "8"
                }
            ]
        },
        {
            "id": 8356,
            "user": {
                "id": 697,
                "name": "artium"
            },
            "notes": "Spyhawk wrote:\r\n> This is indeed part of of the mod. Your suggestion sounds like a good improvement, but we however don't have access to map size information (apart the few that have it somehow in the name).\r\n> I'd say this is more a server administration issue: admins should ensure map selection is adequate for their audience. I don't think we'd be able to find a good technical solution given the current limitation.\r\n\r\nUsually, the number of players varies through the day/week/year so admins can't really know which map sizes to put there in advance.\r\n\r\nYou could add an option for the admin to provide the map size information in a script, and if this information available, use it for this feature.\r\n",
            "created_on": "2019-07-05T11:27:21Z",
            "details": []
        },
        {
            "id": 8362,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "I don't think the work required is worth it tbh. Requiring admins to fill data for dozens or hundreds of maps simply won't work. Admins should monitor adjust their map selection to their average audience, and fill the servers with a min amount of bots during lull time. Easy workaround.\r\n\r\nI'm tempted to close this ticket as 'invalid'/'won't do', if nobody objects to it in the next few days.",
            "created_on": "2019-07-06T09:12:58Z",
            "details": []
        },
        {
            "id": 8363,
            "user": {
                "id": 505,
                "name": "ryven"
            },
            "notes": "If we could manipulate map-pool from the lua by implementing corresponding API and hooks, then the functionality could be implemented outside the C-world (using lua) as an external module, to avoid code base clutter. Any volunteer could then fill the generic meta information about the maps in data structure format (i suggest JSON, so it could be reused in different environments), hosted somewhere on github, which could be used to generate the proper map-pool. \r\n\r\nWould also be cool if we could manipulate the campaigns this way by, again, extending lua API, and implement our dynamic-campaign feature in lua, which could also rely on map meta information to compose best possible map combination (like, there are maps that are split onto several pieces, which could all be added in a single continuous campaign).\r\n\r\nThe proper api, hooks and map meta structure would need to be defined to handle all required cases. Perhaps map meta information could also be used to print objective information in shoutcaster mode - if required fields are set (which would be simple enough to do for the competitive map-pool as it's not so big).\r\n\r\nHowever, this is just an idea.",
            "created_on": "2019-07-08T08:45:35Z",
            "details": []
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 1318,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 2,
        "name": "Feature"
    },
    "status": {
        "id": 1,
        "name": "New"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 697,
        "name": "artium"
    },
    "category": {
        "id": 21,
        "name": "Mod generic"
    },
    "fixed_version": {
        "id": 8,
        "name": "2.78"
    },
    "subject": "Select the next maps for voting based on map size and players on server",
    "description": "I hope i am not mistaken and this is part of the mod and not something external. At the end of each round there is a map voting section.\r\nUsually a server has a large number of maps and at the end of each round a subset is selected to be voted for the next map based on some algorithm.\r\nMy suggestion is to choose preferably maps that align well with the number of players in the server.\r\n\r\nI have seen many times servers emptying because a map too small for the number of players was voted and on the other hand, playing Capuzzo airport 6 on 6 is really not fun.",
    "start_date": "2019-07-05",
    "done_ratio": 0,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": ""
        },
        {
            "id": 2,
            "name": "Arch",
            "value": ""
        }
    ],
    "created_on": "2019-07-04T23:17:46Z",
    "updated_on": "2019-07-08T08:45:35Z"
}