{
    "children": null,
    "attachments": null,
    "relations": null,
    "changesets": [],
    "journals": [
        {
            "id": 8566,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "The ETL client allows to switch between SDL2 and OpenAL sound backend. Please check if the issue is related to one or another. You can check the current backend used in console with \"s_backend\".\r\n\r\nbq. Those with this problem have it in both ETL and 2.60b.\r\n\r\nIt seems the issue is independent from the engine used. In that case, the issue could be due to audio drivers, or something done by the mod (NQ). In any case, we'll probably not be able to solve anything, but I'd recommend testing the alternative sound backend provided by ETL client.",
            "created_on": "2019-11-29T21:55:28Z",
            "details": [
                {
                    "property": "attr",
                    "name": "assigned_to_id",
                    "old_value": "1030"
                },
                {
                    "property": "attr",
                    "name": "fixed_version_id",
                    "old_value": "4",
                    "new_value": "22"
                }
            ]
        },
        {
            "id": 8567,
            "user": {
                "id": 1030,
                "name": "snuffs99"
            },
            "notes": "Spyhawk wrote:\r\n> The ETL client allows to switch between SDL2 and OpenAL sound backend. Please check if the issue is related to one or another. You can check the current backend used in console with \"s_backend\".\r\n> \r\n> bq. Those with this problem have it in both ETL and 2.60b.\r\n> \r\n> It seems the issue is independent from the engine used. In that case, the issue could be due to audio drivers, or something done by the mod (NQ). In any case, we'll probably not be able to solve anything, but I'd recommend testing the alternative sound backend provided by ETL client.\r\n\r\nThank you for looking and yeah already tried switching between SDL2 and OpenAL, no joy.\r\nI'll suggest they try and update their audio drivers etc as that was a thought i had before you've mentioned so certainly worth a try i suppose.\r\n\r\nI was really hoping one of you guys had encountered this issue before as i'm at a total loss on what to suggest sort of thing. \r\nRegarding NQ mod, the strange thing is those having problems only seem to have it on FA NQ1 but not on NQ2 or 3 which both run the same NQ 1.2.9_6. I'll ask daredevil if the settings are the same on each server though and with any luck the cause might be found if they are set slightly different for whatever reason. Also i know some of you worked on NQ mod so was worth a mention here.\r\n\r\nAgain thanks for the input and should i find the fix i'll update you here incase others ever have the same problem.\r\n\r\n\r\nRe:\r\n\r\nSnuffs ",
            "created_on": "2019-11-29T23:11:09Z",
            "details": []
        },
        {
            "id": 8580,
            "user": {
                "id": 140,
                "name": "Spyhawk"
            },
            "notes": "Since this is not directly related to ETL, closing the ticket now. Feel free to comment about your findings.",
            "created_on": "2019-12-03T18:08:29Z",
            "details": [
                {
                    "property": "attr",
                    "name": "status_id",
                    "old_value": "1",
                    "new_value": "6"
                },
                {
                    "property": "attr",
                    "name": "done_ratio",
                    "old_value": "0",
                    "new_value": "100"
                }
            ]
        }
    ],
    "watchers": [],
    "time_entries": null,
    "id": 1367,
    "project": {
        "id": 1,
        "name": "ET: Legacy Development"
    },
    "tracker": {
        "id": 1,
        "name": "Bug"
    },
    "status": {
        "id": 6,
        "name": "Invalid"
    },
    "priority": {
        "id": 4,
        "name": "Normal"
    },
    "author": {
        "id": 1030,
        "name": "snuffs99"
    },
    "category": {
        "id": 1,
        "name": "Client"
    },
    "fixed_version": {
        "id": 22,
        "name": "2.77"
    },
    "subject": "Double/echo sounds ETL2.76 ",
    "description": "Hi i'm asking here in the hope someone has come across this problem previously and knows of a fix.\r\n\r\nA few people have mentioned they have echo sounds while trying to play FA NQ1 (https://et.splatterladder.com/?mod=serverinfo&idx=760159) running NQ 1.2.9_6.\r\n\r\nI have a quick video which shows the problem (recorded ETL 2.76)\r\n\r\nhttps://youtu.be/xafSLX9EHD4\r\n\r\nIf it was just 1 person i wouldn't even bother asking but its a few people all with the same problem (echo sounds).\r\n\r\nI personally have no problems and i'm unable to replicate the problem either so i'm at a loss, as stated i really hope someone has come across this problem and knows of an easy fix.\r\n\r\nI've had a search and haven't come across the issue mentioned but fingers crossed its known and fixable.\r\nThose with this problem have it in both ETL and 2.60b.\r\n\r\nThank you for looking and for all the hard work you all put in to keeping the game alive, i appreciate it more than you all know.\r\n\r\nIf you require any extra info then by all means ask and i'll gather what i can.\r\n\r\n\r\n@ Irata\r\n\r\nIts been a long time my friend and i'm very glad to see your still around and a part of both NQ and now ETL.\r\n\r\nOh before i forget  FA daredevil asked me to ask for NQ 1.3.0 haha.\r\n\r\nLove you mate.\r\n\r\n\r\nRe:\r\n\r\nSnuffs (SNL!)",
    "start_date": "2019-11-29",
    "done_ratio": 100,
    "custom_fields": [
        {
            "id": 1,
            "name": "OS",
            "value": "Windows"
        },
        {
            "id": 2,
            "name": "Arch",
            "value": "N/A"
        }
    ],
    "created_on": "2019-11-29T21:43:42Z",
    "updated_on": "2019-12-03T18:08:29Z",
    "closed_on": "2019-12-03T18:08:29Z"
}